## Production: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                      |
|--------|-----------------------------------------------|
| add    | `aws_iam_policy.quicksight-s3-usage`          |
|        | `aws_iam_role_policy_attachment.s3-qs-attach` |
|        | `aws_quicksight_data_source.s3_sms_usage`     |
|        | `aws_s3_object.manifest_file`                 |
| update | `aws_quicksight_data_set.notifications`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.quicksight-s3-usage will be created
  + resource "aws_iam_policy" "quicksight-s3-usage" {
      + arn         = (known after apply)
      + description = "Allow access to S3"
      + id          = (known after apply)
      + name        = "s3-usage"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:ListBucket",
                          + "s3:ListBucketMultipartUploads",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.s3-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "s3-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "quicksight"
    }

  # aws_quicksight_data_set.notifications will be updated in-place
  ~ resource "aws_quicksight_data_set" "notifications" {
        id             = "296255494825,notifications"
        name           = "Notifications"
        tags           = {}
        # (6 unchanged attributes hidden)

      - physical_table_map {
          - physical_table_map_id = "notifications" -> null

          - custom_sql {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:296255494825:datasource/NotificationCanadaCaproduction" -> null
              - name            = "notifications" -> null
              - sql_query       = <<-EOT
                    with notification_data as (
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id
                                from notifications
                              union
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id
                                from notification_history
                            ),
                            service_data as (
                              select
                                s.id as service_id,
                                s.active as service_active,
                                count_as_live as service_count_as_live,
                                s.go_live_at as service_go_live_at,
                                s.name as service_name,
                                s.message_limit as service_message_limit,
                                s.rate_limit as service_rate_limit,
                                s.sms_daily_limit as service_sms_daily_limit,
                                o.name as organisation_name,
                                s.organisation_id
                              from services s join organisation o on s.organisation_id = o.id
                            ),
                            template_data as (
                              select
                                id as template_id,
                                created_at as template_created_at,
                                name as template_name,
                                updated_at as template_updated_at,
                                version as template_version
                              from templates
                            )
                            select
                              notification_id, notification_created_at, notification_sent_at, notification_status,
                              notification_queue_name, notification_type, notification_updated_at, job_id, api_key_id, api_key_type,
                              s.*, t.*
                            from notification_data n 
                              join service_data s on n.service_id = s.service_id
                              join template_data t on n.template_id = t.template_id
                EOT -> null

              - columns {
                  - name = "notification_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "notification_created_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "notification_sent_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "notification_updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "notification_queue_name" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "notification_status" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "notification_type" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "job_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "api_key_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "api_key_type" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "service_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "service_active" -> null
                  - type = "BIT" -> null
                }
              - columns {
                  - name = "service_count_as_live" -> null
                  - type = "BIT" -> null
                }
              - columns {
                  - name = "service_go_live_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "service_name" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "service_message_limit" -> null
                  - type = "INTEGER" -> null
                }
              - columns {
                  - name = "service_rate_limit" -> null
                  - type = "INTEGER" -> null
                }
              - columns {
                  - name = "service_sms_daily_limit" -> null
                  - type = "INTEGER" -> null
                }
              - columns {
                  - name = "organisation_name" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "organisation_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "template_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "template_created_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "template_name" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "template_updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "template_version" -> null
                  - type = "INTEGER" -> null
                }
            }
        }
      + physical_table_map {
          + physical_table_map_id = "notifications"

          + custom_sql {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:296255494825:datasource/NotificationCanadaCaproduction"
              + name            = "notifications"
              + sql_query       = <<-EOT
                    with notification_data as (
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id,
                                  reference as notification_reference
                                from notifications
                              union
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id,
                                  reference as notification_reference
                                from notification_history
                            ),
                            service_data as (
                              select
                                s.id as service_id,
                                s.active as service_active,
                                count_as_live as service_count_as_live,
                                s.go_live_at as service_go_live_at,
                                s.name as service_name,
                                s.message_limit as service_message_limit,
                                s.rate_limit as service_rate_limit,
                                s.sms_daily_limit as service_sms_daily_limit,
                                o.name as organisation_name,
                                s.organisation_id
                              from services s join organisation o on s.organisation_id = o.id
                            ),
                            template_data as (
                              select
                                id as template_id,
                                created_at as template_created_at,
                                name as template_name,
                                updated_at as template_updated_at,
                                version as template_version
                              from templates
                            )
                            select
                              notification_id, notification_created_at, notification_sent_at, notification_status,
                              notification_queue_name, notification_type, notification_updated_at, 
                              notification_reference, job_id, api_key_id, api_key_type,
                              s.*, t.*
                            from notification_data n 
                              join service_data s on n.service_id = s.service_id
                              join template_data t on n.template_id = t.template_id
                EOT

              + columns {
                  + name = "notification_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_created_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_sent_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_updated_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_queue_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_reference"
                  + type = "STRING"
                }
              + columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "api_key_type"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_active"
                  + type = "BIT"
                }
              + columns {
                  + name = "service_count_as_live"
                  + type = "BIT"
                }
              + columns {
                  + name = "service_go_live_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "service_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_message_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "service_rate_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "service_sms_daily_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "organisation_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "organisation_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_created_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "template_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_updated_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_quicksight_data_source.s3_sms_usage will be created
  + resource "aws_quicksight_data_source" "s3_sms_usage" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_source_id = "s3-sms-usage"
      + id             = (known after apply)
      + name           = "SMS Usage Data Source"
      + tags_all       = (known after apply)
      + type           = "S3"

      + parameters {
          + s3 {
              + manifest_file_location {
                  + bucket = "sns_sms_usage_report_bucket"
                  + key    = "quicksight/s3-manifest-sms-usage.json"
                }
            }
        }
    }

  # aws_s3_object.manifest_file will be created
  + resource "aws_s3_object" "manifest_file" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = "sns_sms_usage_report_bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "a687d10ac9082c405f228ac19bdbe91d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "quicksight/s3-manifest-sms-usage.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./s3-manifests/s3-manifest-sms-usage.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

36 tests, 19 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
